{
  "metadata": {
    "total_size": 41228
  },
  "weight_map": {
    "model.embed_tokens.weight": "model.safetensors",
    "model.layers.0.input_layernorm.weight": "model.safetensors",
    "model.layers.0.mlp.down_proj.weight": "model.safetensors",
    "model.layers.0.mlp.gate_proj.weight": "model.safetensors",
    "model.layers.0.mlp.up_proj.weight": "model.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model.safetensors",
    "model.layers.1.input_layernorm.weight": "model.safetensors",
    "model.layers.1.mlp.down_proj.weight": "model.safetensors",
    "model.layers.1.mlp.gate_proj.weight": "model.safetensors",
    "model.layers.1.mlp.up_proj.weight": "model.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model.safetensors",
    "model.layers.1.self_attn.k_proj.weight": "model.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model.safetensors",
    "model.layers.1.self_attn.q_proj.weight": "model.safetensors",
    "model.layers.1.self_attn.v_proj.weight": "model.safetensors",
    "model.norm.weight": "model.safetensors"
  }
}
